Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Changing the title prevents the script from being identified as such.
pt_br: Alterar o título impede que o script seja identificado como tal.

source: Global variables are visible in the "global scope" (that is, outside of functions), but must usually be declared to make them visible inside a function.
pt_br: Variáveis globais são visíveis no “escopo global” (isto é, fora de funções), mas devem normalmente ser declaradas para ficarem visíveis dentro de uma função.

source: SendMode can be used to make Send synonymous with SendInput or SendPlay.
pt_br: SendMode pode ser usado para fazer com que Send torne-se sinônimo de SendInput ou SendPlay.

source: Local variables are visible only inside the function which created them.
pt_br: Variáveis locais são visíveis somente dentro da função que as criou.

source: /A32 or /ANSI:
pt_br: /A32 ou /ANSI:

source: /U64 or /x64:
pt_br: /U64 ou /x64:

source: Send !+a presses Alt+Shift+A
pt_br: Send !+a pressiona Alt+Shift+A

source: Send !a presses Alt+A
pt_br: Send !a pressiona Alt+A

source: Send #e holds down Win and then presses E
pt_br: Send #e segura Win e então pressiona E

source: Send +abC sends the text "AbC"
pt_br: Send +abC envia o texto "AbC"

source: Send ^{Home} presses Ctrl+Home
pt_br: Send ^{Home} pressiona Ctrl+Home

source: Send, My First Script is how you send keystrokes.
pt_br: Send, Meu primeiro script é como você envia (send) pressionamentos de teclas.

source: ^j:: is the hotkey.
pt_br: ^j:: é a hotkey.

source: `n, `r and `r`n are all translated to a single Enter, unlike the default behavior and Raw mode, which translate `r`n to two Enter.
pt_br: `n, `r e `r`n são todas traduzidas para um único Enter, ao contrário do comportamento padrão e do modo Bruto, que traduzem `r`n para dois Enters.

source: {Blind} is not supported by SendRaw or ControlSendRaw; use {Blind}{Raw} instead.
pt_br: {Blind} não é suportado pelo comando SendRaw ou ControlSendRaw; use {Blind}{Raw} no lugar.

source: MsgBox The current percentage is 25`%. Literal commas must also be escaped (`,) except when used in MsgBox or the last parameter of any command (in which case the accent is permitted but not necessary).
pt_br: MsgBox A porcentagem atual é de 25`%. Vírgulas literais também devem ser escapadas (`,) exceto quando usados dentro de MsgBox ou como último parâmetro de qualquer comando (caso em que o acento é permitido mas não necessário).

source: Run, Notepad.exe "C:\My Documents\Address List.txt".
pt_br: Run, Notepad.exe "C:\Meus Documentos\Lista de Endereços.txt".

source: ^ means Ctrl, j is the letter J.
pt_br: ^ significa Ctrl, j é a letra J.

source: myObj.name is equivalent to myObj["name"], while myObj.123 is equivalent to myObj[123].
pt_br: meuObjeto.name é equivalente a meuObjeto["name"], enquanto meuObjeto.123 é equivalente a meuObjeto[123].

source: {Blind} must be the first item in the string to enable the Blind mode.
pt_br: {Blind} deve ser o primeiro item na string para habilitar o modo Cego.

source: {Enter} and {Space}.
pt_br: {Enter} e {Space}.

source: .Name, [Parameters] and (Parameters), where Name is a literal name or identifier, and Parameters is a list of parameters (as sub-expressions), which can be empty/blank ([] or ()).
pt_br: .Name, [Parâmetros] e (Parâmetros), onde Name é um nome ou identificador literal, e Parâmetros é uma lista de parâmetros (na forma de sub-expressões), a qual pode ser vazia/em branco ([] ou ()).

source: EnvAdd, VarContainingTimestamp, -7, days.
pt_br: EnvAdd, VarContendoOHorario, -7, days.

source: Send is the command, anything after the comma (,) will be typed.
pt_br: Send é o comando, e tudo depois da vírgula (,) será digitado pelo programa.

source: !A produces a different effect in some programs than !a.
pt_br: !A produz um efeito diferente de !a em alguns programas.

source: `t is translated to Tab and `b to Backspace, but all other characters are sent without translation.
pt_br: `t é traduzido para Tab e `b para Backspace, mas todos os demais caracteres são enviados sem tradução.

source: Send {Blind}{Text}your text.
pt_br: Send {Blind}{Text}seu texto.

source: ^A produces a different effect in some programs than ^a.
pt_br: ^A produz um efeito diferente de ^a em alguns programas

source: ; Win+Z hotkey (change this hotkey to suit your preferences).
pt_br: ; Tecla de atalho Win+Z (mude esta hotkey para adequar às suas preferências).

source: Calling a function or command causes the program to invoke, execute or evaluate it.
pt_br: Chamar uma função ou comando faz com que o programa invoque, execute ou calcule-o(a).

source: Control flow is the order in which individual statements are executed.
pt_br: Fluxo de controle é a ordem na qual instruções individuais são executadas.

source: CursorPosition, Total_Items, and entry_is_valid).
pt_br: PosicaoCursor, Total_itens e entrada_eh_valida).

source: Methods are functions which operate on a particular object.
pt_br: Métodos são funções que operam em um objeto em particular.

source: ; The next four lines are the action you want to repeat (update them to suit your preferences):
pt_br: ; As próximas quatro linhas são a ação que você quer que repita (altere-as para adequarem-se às suas necessidades):

source: ; But leave the rest below unchanged.
pt_br: ; Mas deixe o resto abaixo do jeito que está.

source: "So, how exactly does a person such as myself create a hotkey?" Good question.
pt_br: “Ok, então como uma pessoa como eu cria uma hotkey?” Boa pergunta.

source: Index is any integer key.
pt_br: Indice é qualquer chave cujo tipo de dados é um inteiro.

source: * (multiplication)
pt_br: * (multiplicação ou asterisco)

source: + (addition)
pt_br: + (adição)

source: - (subtraction)
pt_br: - (subtração)

source: . / Del
pt_br: . / Del (Observação: nos teclados ABNT/ABNT2, costuma haver uma vírgula na tecla Del, enquanto a tecla “ponto” não tem correspondente com NumLock desligada. Teste seu script para determinar qual das duas teclas é a que funciona.)

source: / (division)
pt_br: / (divisão)

source: 5 / typically does nothing
pt_br: 5 / tipicamente não faz nada

source: Alt (technical info:
pt_br: Alt (informações técnicas:

source: CapsLock (caps lock key)
pt_br: CapsLock (tecla caps lock)

source: CapsLock (using SetCapsLockState is more reliable on Win 2k/XP).
pt_br: CapsLock (usando SetCapsLockState é mais confiável nos Windows 2000 e XP).

source: Ctrl (technical info:
pt_br: Ctrl (informações técnicas:

source: Ctrl+Pause or Ctrl+ScrollLock
pt_br: Ctrl+Pause ou Ctrl+ScrollLock

source: End on main keyboard
pt_br: End no teclado principal

source: Enter on the main keyboard
pt_br: Enter no teclado principal

source: Help.
pt_br: Ajuda.

source: Home on main keyboard
pt_br: Home no teclado principal

source: NumLock (number lock key).
pt_br: NumLock (tecla number lock).

source: NumLock (see also:
pt_br: NumLock (veja também:

source: Pause or Ctrl+NumLock.
pt_br: Pause ou Ctrl+NumLock.

source: PgDn (page down key)
pt_br: PgDn (tecla page down)

source: PgDn on main keyboard
pt_br: PgDn no teclado principal

source: PgUp (page up key)
pt_br: PgUp (tecla page up)

source: PgUp on main keyboard
pt_br: PgUp no teclado principal

source: PrtSc (print screen key)
pt_br: PrtSc (tecla print screen)

source: ScrollLock (scroll lock key).
pt_br: ScrollLock (tecla scroll lock).

source: ScrollLock (see also:
pt_br: ScrollLock (veja também:

source: Shift (technical info:
pt_br: Shift (informações técnicas:

source: Sleep.
pt_br: Adormecer

source: Space (space bar)
pt_br: Space (barra de espaço)

source: Space (this is only needed for spaces that appear either at the beginning or the end of the string to be sent -- ones in the middle can be literal spaces)
pt_br: Space (esta só é necessária para enviar strings com espaços que aparecem ou no início ou no final delas — as que vierem no meio podem ser espaços literais.

source: Tab (tabulator key)
pt_br: Tab (tecla de tabulação)

source: Win (Windows logo key)
pt_br: Win (Tecla do logo do Windows)

source: ← (left arrow key)
pt_br: ← (tecla seta para a esquerda)

source: ← (left arrow) on main keyboard
pt_br: ↑ (seta para a esquerda) no teclado principal

source: ↑ (up arrow key)
pt_br: ↑ (tecla seta para cima)

source: ↑ (up arrow) on main keyboard
pt_br: ↑ (seta para cima) no teclado principal

source: → (right arrow key)
pt_br: → (tecla seta para a direita)

source: → (right arrow) on main keyboard
pt_br: ↑ (seta para a direita) no teclado principal

source: ↓ (down arrow key)
pt_br: ↓ (tecla seta para baixo)

source: ↓ (down arrow) on main keyboard
pt_br: ↑ (seta para baixo) no teclado principal

source: 7-zip Error: Use 7-zip or a compatible program to extract the setup files from the installer EXE, then run setup.exe or Installer.ahk (drag and drop Installer.ahk onto AutoHotkeyU32.exe).
pt_br: Erro do 7-zip: Use o 7-zip ou um programa compatível para extrair os arquivos de instalação do EXE de instalação, daí execute o arquivo setup.exe ou Installer.ahk (arraste e solte o Installer.ahk sobre o AutoHotkeyU32.exe).

source: MyVar := SubStr("I'm scripting, awesome!", 16)
pt_br: MinhaVar := SubStr("Estou escrevendo um script, uau!", 16)

source: Allowed characters: Letters, numbers, non-ASCII characters, and the following symbols:
pt_br: Caracteres permitidos: letras, números, caracteres não ASCII e os símbolos seguintes:

source: Alternate solutions:
pt_br: Soluções alternativas:

source: Call a method, denoted by ().
pt_br: Call (chamar) um método, denotado por ().

source: Case sensitivity: None for ASCII characters.
pt_br: Diferenciação entre maiúsculas e minúsculas: nenhuma para caracteres ASCII.

source: Caution: This table does not apply to hotkeys.
pt_br: Cuidado: a tabela mencionada acima não se aplica às hotkeys.

source: Character: Generally, other parts of this documentation use the term "character" to mean a string's smallest unit; bytes for ANSI strings and 16-bit code units for Unicode (UTF-16) strings.
pt_br: Caractere: geralmente, outras partes desta documentação usam o termo “caractere” para se referir à menor unidade de uma string; usa-se aqui também “bytes” para strings ANSI e “unidades de código 16 bits” para strings Unicode (UTF-16).

source: ControlGetText, OutputVar , Control, WinTitle, WinText, ExcludeTitle, ExcludeText
pt_br: ControlGetText, VarDeSaida , Control, TituloJanela, TextoJanela, TituloExcluido, TextoExcluido

source: ControlSend , Control, Keys, WinTitle, WinText, ExcludeTitle, ExcludeText
pt_br: ControlSend , Controle, Teclas, TituloDaJanela, TextoDaJanela, ExcluirTitulo, ExcluirTexto

source: Deprecated: Use the synonym Enter instead to reduce ambiguity.
pt_br: Obsoleto: Use o sinônimo Enter em vez de Return para evitar ambiguidade.

source: Deprecated: Use the synonym Pause instead.
pt_br: Obsoleto: Use o sinônimo Pause em vez de Break para evitar ambiguidade.

source: Encoding: The encoding of a string defines how symbols are mapped to ordinal numbers, and ordinal numbers to bytes.
pt_br: Codificação: a codificação de uma string define como os símbolos são mapeados para números ordinais, e números ordinais para bytes.

source: Extract:
pt_br: Extrair:

source: Get a value.
pt_br: Get (obter) um valor.

source: Joy1 through Joy32:
pt_br: Joy1 a Joy32:

source: JoyU and JoyV:
pt_br: JoyU e JoyV:

source: JoyX, JoyY, and JoyZ:
pt_br: JoyX, JoyY, e JoyZ:

source: Known issue: Keyboard shortcuts for menu items do not work while the script is displaying a message box or other dialog.
pt_br: Problema conhecido: atalhos de teclado para itens de menu não funcionam enquanto o script estiver exibindo uma caixa de mensagem ou outro diálogo.

source: Known limitation: VK hotkeys that are forced to use the keyboard hook, such as *VK24 or ~VK24, will fire for only one of the keys, not both (e.g. NumpadHome but not Home).
pt_br: Limitação conhecida: hotkeys de chave virtual que são forçadas a usar o gancho de teclado, como *VK24 ou ~VK24, serão acionadas somente por uma das teclas, não ambas (por exemplo, NumpadHome mas não Home.

source: Known limitations:
pt_br: Limitações conhecidas:

source: Maximum length: 253 characters.
pt_br: Comprimento máximo: 253 caracteres.

source: Multiple Joysticks:
pt_br: Joysticks Múltiplos:

source: Native encoding: Although AutoHotkey provides ways to work with text in various encodings, the built-in commands and functions--and to some degree the language itself--all assume string values to be in one particular encoding.
pt_br: Codificação nativa: apesar de o AutoHotkey proporcionar meios de trabalhar com texto em várias codificações, os comandos e funções nativos — e até certo ponto a linguagem em si — assumem, todos eles, que os valores de strings estão em uma codificação em particular.

source: Note: Due to reliance on null-termination, AutoHotkey v1 does not generally support strings with embedded null characters.
pt_br: Observação: devido à dependência na terminação no caractere nulo, o AutoHotkey v1 em geral não suporta strings com caracteres nulos incorporados.

source: Note: If you press the following button, ActiveX is used to create a config file named 'chm_config.js' in the same directory as the CHM file, with the following content:
pt_br: Observação: se você pressionar o botão a seguir, o ActiveX é usado para criar um arquivo de configuração chamado 'chm_config.js' no mesmo diretório do arquivo CHM, com o conteúdo abaixo:

source: Note: Installer.ahk must be run as admin to work correctly.
pt_br: Observação:o script Installer.ahk deve ser executado como administrador para funcionar corretamente.

source: Note: There are exceptions, but those tend to cause confusion a lot of the time.
pt_br: Nota: Há exceções, mas elas várias vezes tendem a causar confusão.

source: Note: There are several different forms of Send.
pt_br: Observação: há diferentes formas do comando Send.

source: Note: There are some decimal fractions which the binary floating-point format cannot precisely represent, so a number is rounded to the closest representable number.
pt_br: Observação: há algumas frações decimais cujo formato de ponto flutuante não pode representar precisamente, então um número é arredondado para o número representável mais próximo.

source: Note: Windows IME may interfere with the detection and functionality of CapsLock; see CapsLock and IME for details.
pt_br: Observação: O IME do Windows pode interferir com a detecção e funcionamento do CapsLock; vide CapsLock e IME para detalhes.

source: Note:
pt_br: Observação:

source: Null-termination: Each string is terminated with a "null character", or in other words, a character with binary value zero marks the end of the string.
pt_br: Terminação nula: cada string é finalizada com um “caractere nulo”, ou, em outras palavras, um caractere com valor binário zero marca o fim da string.

source: Numeric strings: A string of digits (or any other supported number format) is automatically interpreted as a number when a math operation or comparison requires it.
pt_br: Strings numéricas: uma string de dígitos (ou qualquer outro formato de número suportado) é automaticamente interpretado como um número quando uma operação matemática ou comparação o requer.

source: Older, less reliable method: The technique in the following example will work with MS Internet Explorer for most pages.
pt_br: Um método mais antigo e menos confiável: a técnica no exemplo a seguir funcionará com o Internet Explorer na maioria das páginas.

source: Other: The suggestions above cover the most common problems.
pt_br: Outros problemas: As sugestões acima cobrem a maior parte dos problemas.

source: Restart scripts [v1.1.19.02+]:
pt_br: Reiniciar scripts [v1.1.19.02+]:

source: Reverse direction:
pt_br: Sentido contrário:

source: See Also:
pt_br: Veja também:

source: Send: By default, Send is synonymous with SendEvent; but it can be made a synonym for SendInput or SendPlay via SendMode.
pt_br: Send: por padrão, Send é sinônimo de SendEvent; mas também pode se tornar um sinônimo de SendInput ou SendPlay por meio do comando SendMode.

source: Send Keys
pt_br: Send Teclas

source: SendEvent [v1.0.43+]: SendEvent sends keystrokes using the same method as the pre-1.0.43 Send command.
pt_br: SendEvent [v1.0.43+]: SendEvent envia pressionamentos de tecla usando o mesmo método do comando Send tal como este funcionava nas versões anteriores à 1.0.43.

source: SendInput and SendPlay [v1.0.43+]: SendInput and SendPlay use the same syntax as Send but are generally faster and more reliable.
pt_br: SendInput e SendPlay [v1.0.43+]: SendInput e SendPlay usam a mesma sintaxe do Send mas são geralmente mais rápidas e mais confiáveis.

source: SendRaw: Similar to Send, except that all characters in Keys are interpreted and sent literally.
pt_br: SendRaw: similar ao Send, exceto que todos os caracteres das Teclas são interpretados e enviados literalmente.

source: Set a value, denoted by :=.
pt_br: Set (definir) um valor, denotado por :=.

source: Setup hangs: If the setup window comes up blank or not at all, try one or both of the following:
pt_br: Travamentos na instalação: Se a janela de instalação aparece em branco ou nem aparece, tente uma ou ambas as soluções a seguir:

source: Taskbar buttons [v1.1.08+]:
pt_br: Botões da barra de tarefas [v1.1.08+]:

source: This is important: A lot of games, especially modern ones, have cheat prevention software.
pt_br: Isto é importante: vários jogos, especialmente os mais modernos, têm sistemas de prevenção de cheats.

source: Tip: If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the button which appears in the top-right of the code block when you hover your mouse over it.
pt_br: Dica: se seu navegador suporta, você pode fazer o download de qualquer bloco de código (como o acima) como um arquivo de script clicando-se no botão que aparece no canto superior direito do retângulo quando você passa o cursor do mouse sobre.

source: Uninstall:
pt_br: Desinstalação:

source: Version:
pt_br: Versão:

source: Warning: Only Send, GetKeyName(), GetKeyVK(), GetKeySC() and #MenuMaskKey support combining VKnn and SCnnn.
pt_br: Aviso: somente Send, GetKeyName(), GetKeyVK(), GetKeySC() e #MenuMaskKey suportam a combinação de VKnn com SCnnn.

source: [AHK_L 51+]: Renaming AutoHotkey.exe also changes which script it runs by default, which can be an alternative to compiling a script for use on a computer without AutoHotkey installed.
pt_br: [AHK_L 51+]: renomear AutoHotkey também faz mudar qual script o executável roda por padrão, o que pode ser uma alternativa à compilação do script para usar num computador sem o AutoHotkey instalado.

source: [v1.0.48+]: Scroll to the left or right.
pt_br: [v1.0.48+]: Rolar para a esquerda ou para a direita.

source: [v1.1.24.02+]: For command-line installations, specify /IsHostApp or /IsHostApp=1 to enable the option and /IsHostApp=0 to disable it.
pt_br: [v1.1.24.02+]: para instalações via linha de comando, especifique as opções /IsHostApp ou /IsHostApp=1 para habilitar a opção e /IsHostApp=0 para desabilitá-la.

source: [v1.1.27+]: Enclosing a plain ASCII letter (a-z or A-Z) in braces forces it to be sent as the corresponding virtual keycode, even if the character does not exist on the current keyboard layout.
pt_br: [v.1.1.27+]: envolver uma letra puramente ASCII (a-z ou A-Z) em chaves força-a a ser enviada com o código de tecla virtual, mesmo se o caractere não existir no layout do teclado em uso.

source: [v1.1.27+]: The letters a-z or A-Z can be used to refer to the corresponding virtual keycodes (usually vk41-vk5A) even if they are not included in the current keyboard layout.
pt_br: [v1.1.27+]: As letras a-z ou A-Z podem ser usadas para se referir aos códigos virtuais correspondentes (normalmente vk41-vk5A) mesmo se eles não estiverem inclusos no layout em uso no teclado.

source: [v1.1.29+]: Like the Blind mode, the Text mode ignores SetStoreCapsLockMode (that is, the state of CapsLock is not changed) and does not wait for Win to be released.
pt_br: [v1.1.29+]: como no modo Cego, o modo Texto ignora o SetStoreCapsLockMode (isto é, o estado da tecla CapsLock não é alterado) e não espera que a tecla Win seja solta.

source: ByRef parameters allow you to pass a variable by reference, or in other words, to make one parameter of the function an alias for your variable, allowing the function to assign a new value to your variable.
pt_br: Parâmetros ByRef permitem que você passe uma variável por referência, ou, em outras palavras, tornar um parâmetro da função um codinome para sua variável, permitindo que a função atribua um novo valor para sua variável.

source: SendRaw Keys
pt_br: SendRaw Teclas

source: Z (has Z axis), R (has R axis), U (has U axis), V (has V axis), P (has POV control), D (the POV control has a limited number of discrete/distinct settings), C (the POV control is continuous/fine).
pt_br: Z (possui um eixo Z), R (possui um eixo R), U (possui um eixo U), V (possui um eixo V), P (possui controle de ponto de visão), D (o controle de ponto de visão possui um número limitado de configurações discretas/distintas), C (o controle de ponto de visão é contínuo).

source: SendInput Keys
pt_br: SendInput Teclas

source: SendPlay Keys
pt_br: SendPlay Teclas

source: SendEvent Keys
pt_br: SendEvent Teclas

source: [v1.1.27+]: The presence of an invalid suffix prevents VKnn from being recognized.
pt_br: [v1.1.27+]: A presença de um sufixo inválido impede VKnn de ser reconhecida.

source: A boolean value can be either true or false.
pt_br: Um valor booleano pode ou ser verdadeiro ou falso.

source: A function or command is the basic means by which a script does something.
pt_br: Uma função ou comando é o meio primordial pelo qual um script faz algo.

source: A pure or binary number is one which is stored in memory in a format that the computer's CPU can directly work with, such as to perform math.
pt_br: Um número puro ou binário é aquele que é armazenado na método em um formato com que o processador do computador pode trabalhar diretamente, como para realizar operações matemáticas.

source: A statement is simply the smallest standalone element of the language that expresses some action to be carried out.
pt_br: Uma instrução é simplesmente o menor elemento da linguagem que expressa uma ação a ser executada.

source: A string is simply text.
pt_br: Uma string é simplesmente texto.

source: A value is simply a piece of information within a program.
pt_br: Um valor é simplesmente um pedaço de informação dentro de um programa.

source: A boolean value could also represent yes or no, on or off, down or up (such as for GetKeyState) and so on.
pt_br: Um valor booleano também pode representar sim ou não, ligado ou desligado, pressionada ou solta (nas situações em que o estado de uma tecla é verificado, tal como ocorre quando se usa o comando GetKeyState), entre outros.

source: A change such as myObj.ans := 42 would be reflected by both myObj.ans and yourObj.ans, since they both refer to the same object.
pt_br: Uma alteração como meuObjeto.resposta := 42 seria refletida tanto em meuObjeto.resposta e seuObjeto.resposta, uma vez que ambos se referem ao mesmo objeto.

source: A combination of the three expression assignments above.
pt_br: Uma combinação das três formas de se atribuir variáveis acima.

source: A combination of the two legacy assignments above.
pt_br: Uma combinação das duas formas legadas anteriores.

source: A common issue lots of people have is, they assume that the curly brackets are put in the documentation pages just for fun.
pt_br: Um problema comum que muita gente tem é achar que as chaves são inseridas na documentação só diversão.
